Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256MU206.h
/* RPINR28 */
#define _U4RXR RPINR28bits.U4RXR
#define _U4CTSR RPINR28bits.U4CTSR
#define _U4RXR0 RPINR28bits.U4RXR0
#define _U4RXR1 RPINR28bits.U4RXR1
#define _U4RXR2 RPINR28bits.U4RXR2
#define _U4RXR3 RPINR28bits.U4RXR3
#define _U4RXR4 RPINR28bits.U4RXR4
#define _U4RXR5 RPINR28bits.U4RXR5
#define _U4RXR6 RPINR28bits.U4RXR6
#define _U4CTSR0 RPINR28bits.U4CTSR0
#define _U4CTSR1 RPINR28bits.U4CTSR1
#define _U4CTSR2 RPINR28bits.U4CTSR2
#define _U4CTSR3 RPINR28bits.U4CTSR3
#define _U4CTSR4 RPINR28bits.U4CTSR4
#define _U4CTSR5 RPINR28bits.U4CTSR5
#define _U4CTSR6 RPINR28bits.U4CTSR6

/* RPINR29 */
#define _SDI3R RPINR29bits.SDI3R
#define _SCK3R RPINR29bits.SCK3R
#define _SDI3R0 RPINR29bits.SDI3R0
#define _SDI3R1 RPINR29bits.SDI3R1
#define _SDI3R2 RPINR29bits.SDI3R2
#define _SDI3R3 RPINR29bits.SDI3R3
#define _SDI3R4 RPINR29bits.SDI3R4
#define _SDI3R5 RPINR29bits.SDI3R5
#define _SDI3R6 RPINR29bits.SDI3R6
#define _SCK3R0 RPINR29bits.SCK3R0
#define _SCK3R1 RPINR29bits.SCK3R1
#define _SCK3R2 RPINR29bits.SCK3R2
#define _SCK3R3 RPINR29bits.SCK3R3
#define _SCK3R4 RPINR29bits.SCK3R4
#define _SCK3R5 RPINR29bits.SCK3R5
#define _SCK3R6 RPINR29bits.SCK3R6

/* RPINR30 */
#define _SS3R RPINR30bits.SS3R
#define _SS3R0 RPINR30bits.SS3R0
#define _SS3R1 RPINR30bits.SS3R1
#define _SS3R2 RPINR30bits.SS3R2
#define _SS3R3 RPINR30bits.SS3R3
#define _SS3R4 RPINR30bits.SS3R4
#define _SS3R5 RPINR30bits.SS3R5
#define _SS3R6 RPINR30bits.SS3R6

/* RPINR37 */
#define _SYNCI1R RPINR37bits.SYNCI1R
#define _SYNCI1R0 RPINR37bits.SYNCI1R0
#define _SYNCI1R1 RPINR37bits.SYNCI1R1
#define _SYNCI1R2 RPINR37bits.SYNCI1R2
#define _SYNCI1R3 RPINR37bits.SYNCI1R3
#define _SYNCI1R4 RPINR37bits.SYNCI1R4
#define _SYNCI1R5 RPINR37bits.SYNCI1R5
#define _SYNCI1R6 RPINR37bits.SYNCI1R6

/* RPINR38 */
#define _SYNCI2R RPINR38bits.SYNCI2R
#define _DTCMP1R RPINR38bits.DTCMP1R
#define _SYNCI2R0 RPINR38bits.SYNCI2R0
#define _SYNCI2R1 RPINR38bits.SYNCI2R1
#define _SYNCI2R2 RPINR38bits.SYNCI2R2
#define _SYNCI2R3 RPINR38bits.SYNCI2R3
#define _SYNCI2R4 RPINR38bits.SYNCI2R4
#define _SYNCI2R5 RPINR38bits.SYNCI2R5
#define _SYNCI2R6 RPINR38bits.SYNCI2R6
#define _DTCMP1R0 RPINR38bits.DTCMP1R0
#define _DTCMP1R1 RPINR38bits.DTCMP1R1
#define _DTCMP1R2 RPINR38bits.DTCMP1R2
#define _DTCMP1R3 RPINR38bits.DTCMP1R3
#define _DTCMP1R4 RPINR38bits.DTCMP1R4
#define _DTCMP1R5 RPINR38bits.DTCMP1R5
#define _DTCMP1R6 RPINR38bits.DTCMP1R6

/* RPINR39 */
#define _DTCMP2R RPINR39bits.DTCMP2R
#define _DTCMP3R RPINR39bits.DTCMP3R
#define _DTCMP2R0 RPINR39bits.DTCMP2R0
#define _DTCMP2R1 RPINR39bits.DTCMP2R1
#define _DTCMP2R2 RPINR39bits.DTCMP2R2
#define _DTCMP2R3 RPINR39bits.DTCMP2R3
#define _DTCMP2R4 RPINR39bits.DTCMP2R4
#define _DTCMP2R5 RPINR39bits.DTCMP2R5
#define _DTCMP2R6 RPINR39bits.DTCMP2R6
#define _DTCMP3R0 RPINR39bits.DTCMP3R0
#define _DTCMP3R1 RPINR39bits.DTCMP3R1
#define _DTCMP3R2 RPINR39bits.DTCMP3R2
#define _DTCMP3R3 RPINR39bits.DTCMP3R3
#define _DTCMP3R4 RPINR39bits.DTCMP3R4
#define _DTCMP3R5 RPINR39bits.DTCMP3R5
#define _DTCMP3R6 RPINR39bits.DTCMP3R6

/* RPINR40 */
#define _DTCMP4R RPINR40bits.DTCMP4R
#define _DTCMP5R RPINR40bits.DTCMP5R
#define _DTCMP4R0 RPINR40bits.DTCMP4R0
#define _DTCMP4R1 RPINR40bits.DTCMP4R1
#define _DTCMP4R2 RPINR40bits.DTCMP4R2
#define _DTCMP4R3 RPINR40bits.DTCMP4R3
#define _DTCMP4R4 RPINR40bits.DTCMP4R4
#define _DTCMP4R5 RPINR40bits.DTCMP4R5
#define _DTCMP4R6 RPINR40bits.DTCMP4R6
#define _DTCMP5R0 RPINR40bits.DTCMP5R0
#define _DTCMP5R1 RPINR40bits.DTCMP5R1
#define _DTCMP5R2 RPINR40bits.DTCMP5R2
#define _DTCMP5R3 RPINR40bits.DTCMP5R3
#define _DTCMP5R4 RPINR40bits.DTCMP5R4
#define _DTCMP5R5 RPINR40bits.DTCMP5R5
#define _DTCMP5R6 RPINR40bits.DTCMP5R6

/* RPINR41 */
#define _DTCMP6R RPINR41bits.DTCMP6R
#define _DTCMP6R0 RPINR41bits.DTCMP6R0
#define _DTCMP6R1 RPINR41bits.DTCMP6R1
#define _DTCMP6R2 RPINR41bits.DTCMP6R2
#define _DTCMP6R3 RPINR41bits.DTCMP6R3
#define _DTCMP6R4 RPINR41bits.DTCMP6R4
#define _DTCMP6R5 RPINR41bits.DTCMP6R5
#define _DTCMP6R6 RPINR41bits.DTCMP6R6

/* DFCON */
#define _DFCMD DFCONbits.DFCMD
#define _DFIPE DFCONbits.DFIPE
#define _DFERR DFCONbits.DFERR
#define _DFWREN DFCONbits.DFWREN
#define _DFST DFCONbits.DFST
#define _DFIDL DFCONbits.DFIDL
#define _DFRDY DFCONbits.DFRDY
#define _DFEN DFCONbits.DFEN
#define _DFCMD0 DFCONbits.DFCMD0
#define _DFCMD1 DFCONbits.DFCMD1
#define _DFERR0 DFCONbits.DFERR0
#define _DFERR1 DFCONbits.DFERR1

/* DFADDR */
#define _DFADDR DFADDRbits.DFADDR

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _URERR NVMCONbits.URERR
#define _RPDF NVMCONbits.RPDF
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

/* NVMADRH */
#define _ADDR NVMADRHbits.ADDR

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _VREGSF RCONbits.VREGSF
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _LPOSCEN OSCCONbits.LPOSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _PLLPOST CLKDIVbits.PLLPOST
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPOST0 CLKDIVbits.PLLPOST0
#define _PLLPOST1 CLKDIVbits.PLLPOST1
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLDIV PLLFBDbits.PLLDIV
#define _PLLDIV0 PLLFBDbits.PLLDIV0
#define _PLLDIV1 PLLFBDbits.PLLDIV1
#define _PLLDIV2 PLLFBDbits.PLLDIV2
#define _PLLDIV3 PLLFBDbits.PLLDIV3
#define _PLLDIV4 PLLFBDbits.PLLDIV4
#define _PLLDIV5 PLLFBDbits.PLLDIV5
#define _PLLDIV6 PLLFBDbits.PLLDIV6
#define _PLLDIV7 PLLFBDbits.PLLDIV7
#define _PLLDIV8 PLLFBDbits.PLLDIV8

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSSLP REFOCONbits.ROSSLP
#define _ROON REFOCONbits.ROON
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3

/* ACLKCON3 */
#define _APLLPRE ACLKCON3bits.APLLPRE
#define _APLLPOST ACLKCON3bits.APLLPOST
#define _FRCSEL ACLKCON3bits.FRCSEL
#define _ASRCSEL ACLKCON3bits.ASRCSEL
#define _AOSCMD ACLKCON3bits.AOSCMD
#define _SELACLK ACLKCON3bits.SELACLK
#define _APLLCK ACLKCON3bits.APLLCK
#define _ENAPLL ACLKCON3bits.ENAPLL
#define _APPLPRE0 ACLKCON3bits.APPLPRE0
#define _APPLPRE1 ACLKCON3bits.APPLPRE1
#define _APPLPRE2 ACLKCON3bits.APPLPRE2
#define _APLLPOST0 ACLKCON3bits.APLLPOST0
#define _APLLPOST1 ACLKCON3bits.APLLPOST1
#define _APLLPOST2 ACLKCON3bits.APLLPOST2
#define _AOSCMD0 ACLKCON3bits.AOSCMD0
#define _AOSCMD1 ACLKCON3bits.AOSCMD1

/* ACLKDIV3 */
#define _APLLDIV ACLKDIV3bits.APLLDIV
#define _APLLDIV0 ACLKDIV3bits.APLLDIV0
#define _APLLDIV1 ACLKDIV3bits.APLLDIV1
#define _APLLDIV2 ACLKDIV3bits.APLLDIV2

/* PMD1 */
#define _AD1MD PMD1bits.AD1MD
#define _SPI1MD PMD1bits.SPI1MD
#define _SPI2MD PMD1bits.SPI2MD
#define _U1MD PMD1bits.U1MD
#define _U2MD PMD1bits.U2MD
#define _I2C1MD PMD1bits.I2C1MD
#define _DCIMD PMD1bits.DCIMD
#define _PWMMD PMD1bits.PWMMD
#define _QEI1MD PMD1bits.QEI1MD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD
#define _T4MD PMD1bits.T4MD
#define _T5MD PMD1bits.T5MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _OC3MD PMD2bits.OC3MD
#define _OC4MD PMD2bits.OC4MD
#define _IC1MD PMD2bits.IC1MD
#define _IC2MD PMD2bits.IC2MD
#define _IC3MD PMD2bits.IC3MD
#define _IC4MD PMD2bits.IC4MD

/* PMD3 */
#define _I2C2MD PMD3bits.I2C2MD
#define _U3MD PMD3bits.U3MD
#define _CRCMD PMD3bits.CRCMD
#define _CMPMD PMD3bits.CMPMD

/* PMD4 */
#define _USB1MD PMD4bits.USB1MD
#define _CTMUMD PMD4bits.CTMUMD
#define _REFOMD PMD4bits.REFOMD
#define _EEMD PMD4bits.EEMD
#define _U4MD PMD4bits.U4MD

